#include <stdio.h>

int main_2884(void) {
	int H, M;
	scanf_s("%d %d", &H, &M);

	if (H >= 0 && H <= 23 && M >= 0 && M <= 59) {
		if (M < 45) {
			if (H == 0) {
				printf("%d %d", 23, M + 15);
			}
			else {
				printf("%d %d", H - 1, M + 15);
			}
		}
		else {
			printf("%d %d", H, M - 45);
		}
	}
	else {
		printf("범위 : 0 ≤ H ≤ 23, 0 ≤ M ≤ 59");
	}
}

// 문제 : 시간은 0시~23시, 분은 0분~59분까지 있고, 현재 주어지는 시간보다 45분 일찍 알람을 맞추려면?
// 분이 45분 미만이면 시간을 1 빼야 함
// 분이 45분 미만이면서 시간이 0시이면 1을 뺐을 때 결과가 -1이 되므로 23시로 정해줘야 함
// 시간은 분에 따라 빼야할 지 말아야 할 지 결정됨
// 분의 조건에 따라 나누고, 그 안에서 시간 조건에 따라 또 나누면 된다고 생각했음